Revit 2026 API

# FilterCategoryRule Properties

---

The FilterCategoryRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |

#### Reference

FilterCategoryRule Class

Autodesk.Revit.DB Namespace